{

    "server": {

        // The email to display to the users to contact for help..
        "supportEmail": "theteam@axoninteractive.ca",

        // The domain name of the server to act like its from that address. This is used to make
        // links to the server.
        "hostname": "localhost:3000",

        // The mode of the server. [http | https]
        // HTTPS is highly recommended. Your information will not be nearly as safe as it will be
        // running in https mode.
        "mode": "https",

        // The port the server should use when setting up its service
        "port": 3000,

        // The environment the server should act like its running in. [development | production]
        "environment": "development",

        // Boolean switch for the system for email verification.
        "emailVerification": true,

         // The path to the root foler to be hosted by the server
        "wwwRoot": "client/build",

        // The list of folders that require you to be logged into to access
        // "protectedFolders": [
        //     //{ "path": "resources/audio", "roles": [ 'user', 'admin' ] }
        // ],

        // The route in which the API will be served from.
        // Note: This is appended to the hostname
        "apiRoute": "/api",

        // The path to the index.html file to host from wwwRoot
        "indexPath": "index.html",

        // Set true for the server to redirect requests for static content from http to https.
        // Example: http://www.bridge.com/ would become https://www.bridge.com/
        "httpRedirect": false

    },

    // Settings related to the security of the bridge application.
    "security": {
        // The secret string used for token signing and encoding and decoding of JWT's.
        // This is not shared with any application and should be kept a secret from any application.
        "tokenSecret": "!$Th3_X<OSgS0T^{RA4BVRZV$E&aA5NAugzO1)tV<8*LP}sAaHxd9#1eIeg69k>!lUVIf*UB6Ne8SGXzgCFdK%]pSIvfF*xSW0jaIix<45-Hr)$l}beFskzm",

        // The amount of time that a token is valid for before it expires and a user will have to
        // login again. If remember me is not selected the cookie will last until the user closes
        // their browser.
        "tokenExpiryDurationRememberMe": { "days": 7 },

        // Settings used if the server is in https mode
        "sshKeys": {
            "privateKeyfilepath" : "privatekey.pem", // The path to the private key file for the ssl connection.
            "certificatefilepath": "certificate.pem" // The path to the certificate file for the ssl connection.
        }
    },

    // Configuration settings about the database connection
    "database": {
        "user"     : "root",        // The username that should be used to connect to the database
        "password" : "",            // The password for that user that should be used
        "host"     : "localhost",   // The location of the database
        "database" : "peir"         // The name of the database to use for the bridge structure
    },

    // Configuration settings about logging and verbosity
    "logger": {

        // Logging related to server actions such as starting and stopping
        // as well as any request of any kind coming to the server
        "server": {
            "filename"     : "logs/server.log",
            "level"        : "silly",
            "consoleLevel" : "silly"
        },

        // Logging related to exceptions and errors
        "exception": {
            "filename"      : "logs/exceptions.log",
            "writetoconsole": true
        }

    },

    // Configuration settings relating to accounts
    "accounts": {

        // The duration the an account should stay in a recovery state. This is the amount of time
        // that a verification link will be active for.
        "recovertStateDuration": {
            "days": 1
        }
    },

    // Configuration settings relating to the SMTP server
    "mailer": {

        // The address that will be used to send mail.
        // e.g. "Bridge <no-reply@bridge.ca>"
       "fromAddress": "PEIR <admin@peir.ca>",

        // The path from the application root to the folder containing the view to be rendered
        "templateDirectory": "templates/email",

        // Information about the verification email that is sent went a user registers to the site.
        "verificationEmail": {

            // The subject of the email that the user will see in their inbox
            "subject": "Bridge Example Email Verification",
            // The file name of the ejs file in the template directory to be sent as an email html content
            "viewName": "registration.ejs"
        },

        // Information about the account recovery email that is sent when a user forgets their
        // password
        "recoverAccountEmail": {
            // The subject of the email that the user will see in their email inbox when they forget
            // their password
            "subject": "Bridge Example Account Recovery",
            // The file name of the ejs file that will be sent as the HTML content for the bridge
            // account recovery email.
            "viewName": "recoverPassword.ejs"
        },

        // Information about the email that is sent when a user updates their information inside of
        // the database.
        // Note: This is for non AppData and Non Password changes.
        "updatedUserInfoEmail": {
            // The subject of the email that is sent when the users account information is updated
            // inside of the database.
            "subject": "Your account information has been updated",
            // The file name of the email template that is to be rendered when this email is sent to
            // the user when their information is updated.
            "viewName": "updatedUserInformation.ejs"
        },

        // Information about the welcome email which is sent after a user successfully verifies their
        // email and is automatically sent if email verification is turned off.
        "welcomeEmail": {
            // The subject of this email that the user will see in their inbox when they receive
            // this email
            "subject": "Welcome to the site",
            // The file name of the email template that is to be rendered when this email is sent to
            // the user when their information is updated.
            "viewName": "welcome.ejs"
        },

        // Information about the email that a user will get when their password changes inside of
        // the database.
        "updatedUserPasswordEmail": {
            // The subject of this email that the user will see in their inbox when they receive
            // this email.
            "subject": "Your Password has been updated",
            // The file name of the email template that is in the template directory  and is to be
            // rendered to the html content of the email.
            "viewName": "updatedUserPassword.ejs"
        },


        // The options for the mailer to use
        // See node mailer SMTP transport documentation for examples
        // https://github.com/andris9/nodemailer-smtp-transport#usage
        "options": {
            "service": "gmail",
            "auth": {             // The authentication to use for the GMail Service
                "user": "BridgeSMTPTest@gmail.com",
                "pass": "passwordGoesHere"
            }
        }
    },

    // Configuration settings for the PDF generator
    "pdfGenerator": {
        "templatePath": "templates/pdfs",         // Path to the ejs template files to use for creating PDF's
        "cacheLifetimeMinutes": 10,               // The amount of time a file should remain alive inside of the cache
        "outputPath": "resources/pdfs/generated/" // The path relative to the www root to write PDFs to.
    },

    // Configuration settings for the excel generator
    "excelGenerator": {
        "templatePath": "templates/xlsx",           // The folder where the templates are stored.
        "cacheLifetimeMinutes": 10,                 // The amount of minutes before a generated file is deleted.
        "outputPath": "resources/xlsx/generated/"   // The folder to use to store xlsx files that are created.
    }
}
